UR_SDESK.ТелеграмБот/src/Catalogs/тг_Объект/тг_Объект.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>тг_Объект</name>
  <hierarchical>true</hierarchical>
  <hierarchyType>HierarchyOfItems</hierarchyType>
  <attributes>
    <name>Тип</name>
    <type>
      <types>EnumRef.тг_ТипыОбъектов</types>
    </type>
  </attributes>
  <attributes>
    <name>Чат</name>
    <type>
      <types>CatalogRef.тг_Объект</types>
    </type>
  </attributes>
  <attributes>
    <name>Объект1С</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Имя</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>15</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>CatalogRef.тг_Объект</types>
      </type>
    </attributes>
    <attributes>
      <name>Строка</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

UR_SDESK.ТелеграмБот/src/Catalogs/тг_Объект/Forms/ФормаЧата/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	РеквизитыОбъекта = Справочники.тг_Объект.ПолучитьРеквизиты(Объект.Ссылка);
	
	РеквизитыОбъекта.Свойство("Описание", Описание);					
		
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	ДанныеЧата = тг_Сервер.ПолучитьДанныеЧата(ТекущийОбъект.Ссылка);
		
	Если ДанныеЧата <> Неопределено Тогда
			
		Если ДанныеЧата["title"] <> ТекущийОбъект.Наименование Тогда
			тг_Сервер.УстановитьЗаголовокЧата(ТекущийОбъект.Ссылка, ТекущийОбъект.Наименование);
		КонецЕсли;
			
		Если ДанныеЧата["description"] <> Описание Тогда
			тг_Сервер.УстановитьОписаниеЧата(ТекущийОбъект.Ссылка, Описание);
		КонецЕсли;
			
	КонецЕсли;
		
	СтрокаТЧ = ТекущийОбъект.ДополнительныеРеквизиты.Найти("Описание", "Имя");

	Если СтрокаТЧ = Неопределено Тогда
		СтрокаТЧ = ТекущийОбъект.ДополнительныеРеквизиты.Добавить();
		СтрокаТЧ.Имя = "Описание";
	КонецЕсли;
			
	СтрокаТЧ.Строка = Описание;

КонецПроцедуры

#КонецОбласти
